{
  "basics": {
    "name": "Matthew J. Ogram",
    "label": "Software Engineer",
    "picture": "https://avatars3.githubusercontent.com/u/5733079?s=460&u=e8f305e7c990eb5043b764a21cbce53d74c4b000&v=4",
    "email": "matt@ogram.tech",
    "phone": "(858) 472-1036",
    "website": "https://github.com/emjayoh",
    "summary": "Seasoned engineer with passion for emerging frontend technologies and modern approaches to the evolving challenges in the web application space",
    "location": {
      "address": "12043 Alta Carmel Ct",
      "postalCode": "CA 92128",
      "city": "San Diego",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "emjayoh",
        "url": "https://linkedin.com/mattogram"
      },
      {
        "network": "GitHub",
        "username": "mattogram",
        "url": "https://github.com/emjayoh"
      }
    ]
  },
  "work": [
    {
      "company": "Self-employed",
      "position": "Owner / Lead Consultant/ Engineer",
      "startDate": "2016-11-01",
      "endDate": "2018-02-01",
      "summary": "Various contracts and consulting gigs. From WordPress sites to large-scale web applications",
      "highlights": [
        "WeedMaps Delivery application -- ReactJS + MobX and Elixir/GraphQL backend",
        "Patalytics -- ReactJS + Redux patent search engine connecting to multiple patent APIs",
        "Various solo and open-source projects to enhance skillset in my future in frontend development (primary focus on ReactJS)"
      ]
    },
    {
      "company": "Intuit, Inc.",
      "position": "Frontend Engineer / Full-stack Engineer",
      "website": "https://www.intuit.com/",
      "startDate": "2013-10-01",
      "endDate": "2016-11-01",
      "summary": "Initial purpose of position was to revitalize the entire frontend of Intuit Live Community. No RoR/coffee experience. First code to production in 1 week (company average for new employee was 3 months). Refactored and deployed new frontend within 1.5 months (performance, cleanliness, new design, xHTML/css3/JS/SEO best practices, mobile-ready). Began working on other parts of application prior to contract ending. Continued fronted role for about a year, shifts in team composition over time left some holes in backend that needed to be filled. I offered my assistance to fill more and more backend role tasks as needed. RoR/coffee expertise was growing rapidly and I really started to flourish on the team, bringing my full-stack abilities front-and-center. Became very fond of unit testing, automation, and generally writing well-maintainable, clean code that can be easily reviewed by peers and explained without comments. Oversaw shift from angular JS to react JS. Oversaw git branching strategy revitalization (using Atlassian techniques and git libraries to create a more continuousdeployment style of branching optimized for rollbacks and quick bug fixes). Live Community was looking to revitalize their embedded widget platform, removing all iFrames and adopting node/react technology stack. Removing iFrames allows for analytics and UX to flow seamless into Live Community widgets from parent applications (TurboTax, QuickBooks, Mint, Salesforce). Heavily involved in technology stack decisions, took a great risk in undertaking this task for 2016-2017 tax season and committed to deliver (with ample testing). Became fluent in NPM and node and general JS MVC framework technologies and packages. During this position I really realized what the future of Web Development would bring: business logic 100% controlled on frontend MVC, small microservice-based backend API to return simple JSON strings to MVC.",
      "highlights": [
        "Contract-to-hire first 3 months (early full-time adoption, original contract was 6 months)",
        "New to most technologies used, adapted quickly and became a top contributor within weeks",
        "First Intuit team to adopt React, Git, and AWS (high-risk)"
      ]
    },
    {
      "company": "Internet Marketing Inc.",
      "position": "Lead Software Engineer / Project Manager",
      "website": "https://www.internetmarketinginc.com/",
      "startDate": "2012-04-01",
      "endDate": "2013-09-01",
      "summary": "Lead and managed multiple teams of developers (in-house and outsourced) in creating full-featured enterprise websites and web applications. Project ranged in complexity, from simple \"brochure\" style websites to complex Healthcare Provider search engines to e-Commerce. Facilitated countless custom API connections for clients proprietary API services (movie ticketing, legal information). Created and maintained server architecture for many clients, using a custom LAMP stack and optimizing performance/value for given load expectations. Also responsible for our CRO (Conversion-Rate-Optimization) department, using tools such as Visual Website Optimizer and Convert to implement multi-variate experiments. Trained developers on latest web technologies as they emerged, ensuring we were always on the cutting edge of web development. Implemented SVN as standard-practice and trained employees accordingly. Solidified development best-practices and enforced for each project. Since starting at IMI, I have increased the Web Development department's revenue by over 300%. This was achieved by increasing efficiency and throughput while also producing a superior product. Also gained ample experience in client communications and project management as I filled gaps for a new/growing department and shifting employee landscape. Played a key role in weekly client communications as well as initial sales consulting and expectation management",
      "highlights": [
        "Revitalized a dying department, churning out major profit",
        "Built team around me from the ground-up",
        "Go-to engineer for entire company's technical problems and challenges"
      ]
    },
    {
      "company": "Flank Marketing / CheapSally / TabJuice",
      "position": "Senior Software Engineer",
      "website": "https://www.cheapsally.com/",
      "startDate": "2011-06-01",
      "endDate": "2012-04-01",
      "summary": "General website design and management for a broad base of clients. Working closely with a highly talented group of developers and web/social media experts to create beautiful, modern and fully accessible websites using cutting edge SEO technologies and rapid development with custom CMS implementations (LAMP architecture and custom WordPress themes). Experience using JIRA for project/task management. Using Beanstalk to manage our SVN repositories. Recently focused on our proprietary product: http://www.cheapsally.com Responsible for overall UI, backend, SEO and building/tuning LAMP server (CentOS) architecture from scratch utilizing multiple levels of caching: Varnish static page cache, PHP OpCode caching, MySQL query caching and Memcached for PHP session management. Configured MySQL master/slave server architecture independent of web server for maximum performance under high traffic/load. Also responsible for overall website performance: CDN, browser caching, image compression, gzip compression, minification and optimal HTML DOM structuring for asynchronous loading of resources. Using New Relic for server analytics and monitoring to ensure performance remains top notch. Site created using a fully custom WordPress theme and custom-made plugins to suit our specific needs. Experience with complex multi-variate and A/B testing with Visual Website Optimizer, increasing conversion rate and reducing bounce rate by significant amounts. - Example of performance: http://www.webpagetest.org/result/120328_DM_3RN0V/ Latest project involved creating a fully customizable coupon syndication iFrame that affiliates can use to monetize their blogs/sites. Features dynamic frame resizing and a fully asynchronous code snippet to ensure no impact on overall page load. - Example iFrame implementation: http://foodnservice.com/coupon-codes/ Additionally, currently developing/maintaining our Social E-Commerce Application (TabJuice) built on CodeIgniter MVC framework. Integrates seamlessly with Authorize.Net, PayPal and Magento and has over 3000 shops currently set up on Facebook. Backend allows for full branding/appearance customization, payment options and usage statistics. - Example store: https://www.facebook.com/nikawater/app_111032002302150 ",
      "highlights": [
        "Ultimate cross-functional utility engineer - ability to work on all products as needed",
        "Despite no experience with CMS, quickly mastered highly complex WordPress applications",
        "Achieved all-A's on website performance test for all company applications, increasing revenue across the board"
      ]
    },
    {
      "company": "Hold-Free Networks",
      "position": "Software Engineer",
      "startDate": "2011-06-01",
      "endDate": "2012-04-01",
      "summary": "Developed prototype smartphone applications and demos for prospective clients (Delta, Terminix, Dish Networks, AT&T) using web technologies (PHP/MySQL/HTML/CSS/JS) to simulate application-like feel. Also worked on a cross- platform secure business-grade chat client created in Java. Responsible for installation script across all platforms and general UI experience",
      "highlights": [
        "Early exposure to mobile web JavaScript applications",
        "Cross-platform java install scripts which managed dependencies",
        "High stress startup environment",
        "Successfully demod products to large telecommuncation companies"
      ]
    },
    {
      "company": "Craze / RealGifts",
      "position": "Intern -> Lead Software Engineer",
      "startDate": "2007-07-01",
      "endDate": "2011-01-01",
      "summary": "Lead a highly motivated team of developers to create avanced web 2.0 applications using the LAMP architecture. Designed/maintained a specialized, fully object-oriented MVC framework (PHP) that featured an extensive library of custom external API integrations (Authorize.Net, PayPal, Facebook etc.), complex relational databases, support for multiple javascript frameworks (DOJO, jQuery, MooTools, easyXDM), templated CSS and a large suite of internal utility functions/classes relating to all areas of e-commerce, input validation, logging and error handling. The framework also helped ensure protection against a variety of common web application vulnerabilities (SQL injection, XSS), allowed \"pretty\" URL rewrites, and handled database-oriented configurable session management. Created and maintained a fully documented API (PHP), allowing access to a host of services and guaranteeing security/authenticity of requests using SSL, MD5 signatures and public key cryptography. The API featured a backend UI panel, \"instructions\", statistics and other useful information. Obtained ample experience in elegant UI design. Maintained multiple checkout flows with complex A/B testing for analysis. Comprehensive understanding the of the XHTML DOM, including limitless access and manipulation of its elements. High level of expertise in CSS2/3, JS and AJAX needed to build rich, responsive client-side applications. Expert in XML/JSON data formatting and translation techniques. Implemented cross-domain AJAX capabilities in order to circumvent the \"same origin policy\" for iFrames and facilitate seamless protocol changes. Responsible for setting up our project repository in version control (specifically SVN). Well-versed in all SVN commands and IDEs and able to run statistical analysis on code if needed. Placed high emphasis on code portability and re usability, object-oriented design and performance optimization.",
      "highlights": [
        "Early exposure to mobile web JavaScript applications",
        "Cross-platform java install scripts which managed dependencies",
        "Successfully demod products to large telecommuncation companies",
        "High-stress startup environment"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of California, Santa Barbara",
      "area": "Computer Science (Focus: Network Computing)",
      "studyType": "Bachelor of Science",
      "startDate": "2002-06-01",
      "endDate": "2007-06-01",
      "gpa": "",
      "courses": [
        "CS176(A-C) - Advanced Topics in Internet Computing",
        "CSXXX - TODO: Security",
        "CSXXX - TODO: Networking",
        "CSXXX - TODO: AI",
        "CSXXX - Operating Systems"
      ]
    }
  ],
  "skills": [
    {
      "name": "Frontend engineer",
      "level": "Master",
      "keywords": [
        "HTML (4|5)",
        "Javascript: ES6+",
        "Babel",
        "Webpack",
        "React/(Redux|MobX)",
        "Angular",
        "NodeJS",
        "CSS3",
        "S(C|A)SS",
        "LESS",
        "PostCSS",
        "preCSS",
        "ESLint",
        "Prettier",
        "Hot-module reloading",
        "JSON",
        "Advanced debugging",
        "Styled components",
        "Bootstrap (2|3|4)",
        "Material design",
        "Responsive frameworks",
        "npm",
        "TDD",
        "Storybook",
        "Git/GitHub",
        "Git-flow",
        "Cross-browser compatibility (IE6+)",
        "Semantic versioning",
        "Structured release",
        "Static hosting",
        "Performance",
        "Sourcemaps",
        "Cloud Error-reporting (Sentry)",
        "jQuery"
      ]
    },
    {
      "name": "Backend engineer",
      "level": "Proficient",
      "keywords": [
        "Ruby on Rails",
        "PHP",
        "Java",
        "MySQL",
        "DB abstraction",
        "OOD",
        "MVC",
        "Relational database principles",
        "Performance/Scalability",
        "Devops (AWS, CI/CD)",
        "GUI-less linux server administration",
        "CentOS/RedHat/Ubuntu/Debian/AmazonLinux",
        "Varnish",
        "Redis",
        "Memcached",
        "CDN",
        "Nginx/Apache",
        "Security",
        "New Relic",
        "Google analytics certified",
        "CMS",
        "eCommernce/PCI-compliance",
        "SSL",
        "Compression",
        "Emacs",
        "Vagrant/Ansible/Docker"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Spanish",
      "fluency": "Moderate"
    }
  ],
  "interests": [
    {
      "name": "Custom linux builds from scratch",
      "keywords": [
        "ArchLinux",
        "i3 Window Manager",
        "Dotfiles",
        "Developer-focused GUI"
      ]
    },
    {
      "name": "Open Source Software",
      "keywords": []
    },
    {
      "name": "High-end audio / analog",
      "keywords": []
    },
    {
      "name": "Snowsports",
      "keywords": ["Snowboard", "Ski"]
    },
    {
      "name": "Ricing",
      "keywords": [
        "reddit.com/r/unixporn",
        "Zsh",
        "Kitty/Alacritty/Hyper/URXVT/iTerm",
        "Webstorm",
        "VsCode",
        "Emacs",
        "tmux"
      ]
    }
  ],
  "references": [
    {
      "name": "Ryan Pancheri",
      "reference": "Founder and CEO | REPS & Co"
    },
    {
      "name": "Adam Buga",
      "reference": "Director of Architecture | REPS & Co"
    },
    {
      "name": "Scott Graves",
      "reference": "CTO | REPS & Co"
    },
    {
      "name": "Eric Severn",
      "reference": "Product Manage | REPS & Co"
    },
    {
      "name": "Devin Walker",
      "reference": "Senior Developer | Flank Marketing"
    },
    {
      "name": "Dylan Whitman",
      "reference": "CEO | Flank Marketing"
    },
    {
      "name": "Tim Foss",
      "reference": "Lead Frontend Developer | RealGifts"
    },
    {
      "name": "Brent Gleeson",
      "reference": "CEO | IMI"
    }
  ]
}
